#include <stdio.h>

int main(){
	/*
	要点：
	多行字符串 
	转义字符，需要把所有反斜杠替换为双反斜杠 
	*/ 
	
	
	//①用反斜杠放在行末，一个print+多行字符串 
	printf("\
         o                                             \n\
        <|>                                            \n\
        / \\                                            \n\
      o/   \\o       \\o__ __o     o__ __o/    o__  __o  \n\
     <|__ __|>       |     |>   /v     |    /v      |> \n\
     /       \\      / \\   / \\  />     / \\  />      //  \n\
   o/         \\o    \\o/   \\o/  \\      \\o/  \\o    o/    \n\
  /v           v\\    |     |    o      |    v\\  /v __o \n\
 />             <\\  / \\   / \\   <\\__  < >    <\\/> __/> \n\
                                       |               \n\
                               o__     o               \n\
                               <\\__ __/>                \n");
    
                               
    //②每行一个字符串 相邻字符串会自动连接起来 
	printf(
"         o                                             \n"
"        <|>                                            \n"
"        / \\                                            \n"
"      o/   \\o       \\o__ __o     o__ __o/    o__  __o  \n"
"     <|__ __|>       |     |>   /v     |    /v      |> \n"
"     /       \\      / \\   / \\  />     / \\  />      //  \n"
"   o/         \\o    \\o/   \\o/  \\      \\o/  \\o    o/    \n"
"  /v           v\\    |     |    o      |    v\\  /v __o \n"
" />             <\\  / \\   / \\   <\\__  < >    <\\/> __/> \n"
"                                       |               \n"
"                               o__     o               \n"
"                               <\\__ __/>                \n");

    //③暴力拼成一行 —— 
	
	return 0;
}
